SiYi He

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///lab3.db3

'Connected: @lab3.db3'

In [9]:
%%sql
SELECT *
FROM scores;

 * sqlite:///lab3.db3
Done.

[('103', '3-245', 86),
 ('105', '3-245', 75),
 ('109', '3-245', 68),
 ('103', '3-105', 92),
 ('105', '3-105', 88),
 ('109', '3-105', 76),
 ('101', '3-105', 64),
 ('107', '3-105', 91),
 ('108', '3-105', 78),
 ('101', '6-166', 85),
 ('107', '6-106', 79),
 ('108', '6-166', 81)]

In [16]:
%%sql
SELECT *
FROM students

 * sqlite:///lab3.db3
Done.

[('108', 'Peter', 'M', '1997-09-01', '15033'),
 ('105', 'Gary', 'M', '1995-10-02', '15031'),
 ('107', 'Lily', 'F', '1996-01-23', '15033'),
 ('101', 'Alex', 'M', '1996-02-20', '15033'),
 ('109', 'Eva', 'F', '1995-02-10', '15031'),
 ('103', 'Quincy', 'M', '1994-06-03', '15031')]

In [23]:
%%sql
SELECT *
FROM teachers

 * sqlite:///lab3.db3
Done.

[(804, 'Dan', 'M', '1958-12-02', 'AP', 'CS'),
 (856, 'Frank', 'M', '1969-03-12', 'LE', 'EE'),
 (825, 'Alice', 'F', '1999-05-05', 'TA', 'CS'),
 (831, 'Emma', 'F', '1997-08-14', 'TA', 'EE'),
 (856, 'Frank', 'M', '1969-03-12', 'AP', 'CS'),
 (831, 'Emma', 'F', '1997-08-14', 'LE', 'CS')]

Q1: In the score table, find the student number that has all the grades in between 90 and 70.

In [13]:
%%sql 
SELECT sno 
FROM scores 
WHERE grade>70 and grade <90
except 
SELECT sno 
FROM scores
WHERE grade<70 or grade >90

 * sqlite:///lab3.db3
Done.

[('105',), ('108',)]

Q2: For all the courses that took by class 15033, calculate the average grade.

In [20]:
%%sql
SELECT AVG(grade) 
FROM scores, students
WHERE students.class=15033 AND students.sno=scores.sno

 * sqlite:///lab3.db3
Done.

[(79.66666666666667,)]

Q3: Find the class number that has at least two male students.

In [22]:
%%sql
SELECT class
FROM students
WHERE sgender='M'
GROUP BY class
HAVING count(*)>=2

 * sqlite:///lab3.db3
Done.

[('15031',), ('15033',)]

Q4: Find the teacher's name who teaches in both CS and EE department, but has different titles. Return both name and title.

In [27]:
%%sql
SELECT s1.tname, s1.title
FROM (select * 
      from teachers
      where department="CS")s1, 
     (select * 
      from teachers
      where department="EE") s2
WHERE s1.title<>s2.title and s1.tno=s2.tno

 * sqlite:///lab3.db3
Done.

[('Frank', 'AP'), ('Emma', 'LE')]

Q5: Find the students, who took the course number "3-105" and have earned a grade, at least, higher than the students who took "3245" course. Return the results in a descending order of grade.

In [36]:
%%sql
SELECT sno
FROM  scores 
WHERE grade>(SELECT max(grade) --find the highest score in 3-245
              FROM scores
              WHERE cno="3-245") and cno="3-105"
ORDER BY grade DESC

 * sqlite:///lab3.db3
Done.

[('103',), ('107',), ('105',)]

Q6: Find the students, who took more than 1 course, and return the students' names that is not the one with highest grade.

In [41]:
%%sql
SELECT sname
FROM students, scores
WHERE students.sno=scores.sno
GROUP BY scores.sno
HAVING count(scores.cno)>1 and grade<>(SELECT max(s.grade) from scores s)

 * sqlite:///lab3.db3
Done.

[('Alex',), ('Gary',), ('Lily',), ('Peter',), ('Eva',)]

Q7: For each course, find the students who earned a grade less than the average grade of this course.

In [46]:
%%sql
SELECT sno
FROM scores,
    (SELECT avg(s.grade) as grade,s.cno
     FROM scores s
     GROUP BY s.cno) avg
WHERE scores.grade<avg.grade and scores.cno=avg.cno

 * sqlite:///lab3.db3
Done.

[('105',), ('109',), ('109',), ('101',), ('108',), ('108',)]